vertical-pod-autoscaler/experiments/sn-pbr-throughput/19plus/user.log
Running 15m test @ http://10.105.199.124:8080/wrk2-api/post/compose
  2 threads and 4 connections
  Thread calibration: mean lat.: 30.206ms, rate sampling interval: 91ms
  Thread calibration: mean lat.: 32.828ms, rate sampling interval: 94ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   187.45ms  164.94ms 788.48ms   85.07%
    Req/Sec    14.52     12.31    53.00     59.30%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  137.47ms
 75.000%  255.10ms
 90.000%  400.13ms
 99.000%  788.48ms
 99.900%    1.14s 
 99.990%    1.45s 
 99.999%    1.81s 
100.000%    1.81s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.667     0.000000            1         1.00
      41.343     0.100000         2657         1.11
      58.719     0.200000         5305         1.25
      79.679     0.300000         7963         1.43
     105.727     0.400000        10611         1.67
     137.471     0.500000        13267         2.00
     156.415     0.550000        14594         2.22
     175.615     0.600000        15916         2.50
     197.119     0.650000        17244         2.86
     224.255     0.700000        18574         3.33
     255.103     0.750000        19894         4.00
     271.615     0.775000        20565         4.44
     291.071     0.800000        21231         5.00
     312.063     0.825000        21891         5.71
     336.639     0.850000        22550         6.67
     365.823     0.875000        23210         8.00
     382.975     0.887500        23544         8.89
     400.127     0.900000        23872        10.00
     421.375     0.912500        24206        11.43
     443.647     0.925000        24539        13.33
     471.551     0.937500        24870        16.00
     487.935     0.943750        25033        17.78
     505.599     0.950000        25198        20.00
     527.359     0.956250        25366        22.86
     552.959     0.962500        25533        26.67
     583.167     0.968750        25696        32.00
     606.207     0.971875        25780        35.56
     626.175     0.975000        25860        40.00
     649.215     0.978125        25943        45.71
     675.327     0.981250        26026        53.33
     707.071     0.984375        26109        64.00
     725.503     0.985938        26151        71.11
     747.007     0.987500        26192        80.00
     770.559     0.989062        26233        91.43
     798.207     0.990625        26275       106.67
     830.463     0.992188        26316       128.00
     849.407     0.992969        26337       142.22
     864.255     0.993750        26358       160.00
     905.727     0.994531        26378       182.86
     936.959     0.995313        26399       213.33
     973.823     0.996094        26420       256.00
     987.647     0.996484        26430       284.44
    1019.391     0.996875        26441       320.00
    1051.647     0.997266        26451       365.71
    1064.959     0.997656        26461       426.67
    1089.535     0.998047        26473       512.00
    1099.775     0.998242        26477       568.89
    1106.943     0.998437        26482       640.00
    1120.255     0.998633        26487       731.43
    1130.495     0.998828        26492       853.33
    1156.095     0.999023        26498      1024.00
    1166.335     0.999121        26500      1137.78
    1183.743     0.999219        26503      1280.00
    1219.583     0.999316        26505      1462.86
    1251.327     0.999414        26508      1706.67
    1319.935     0.999512        26511      2048.00
    1323.007     0.999561        26512      2275.56
    1336.319     0.999609        26513      2560.00
    1348.607     0.999658        26514      2925.71
    1356.799     0.999707        26516      3413.33
    1374.207     0.999756        26517      4096.00
    1380.351     0.999780        26518      4551.11
    1380.351     0.999805        26518      5120.00
    1393.663     0.999829        26519      5851.43
    1446.911     0.999854        26520      6826.67
    1446.911     0.999878        26520      8192.00
    1469.439     0.999890        26521      9102.22
    1469.439     0.999902        26521     10240.00
    1469.439     0.999915        26521     11702.86
    1475.583     0.999927        26522     13653.33
    1475.583     0.999939        26522     16384.00
    1475.583     0.999945        26522     18204.44
    1475.583     0.999951        26522     20480.00
    1475.583     0.999957        26522     23405.71
    1813.503     0.999963        26523     27306.67
    1813.503     1.000000        26523          inf
#[Mean    =      187.452, StdDeviation   =      164.938]
#[Max     =     1812.480, Total count    =        26523]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  26849 requests in 15.00m, 351.27MB read
  Socket errors: connect 0, read 0, write 5, timeout 0
Requests/sec:     29.83
Transfer/sec:    399.63KB